************************************************************************
* Program ID   : Z2508R0020_084
* Title        : [HW2] ALV02
* Create Date  : 2025-08-06
* Developer    : S4H084 강예인
* Tech. Script :
************************************************************************
* Change History.
************************************************************************
* Mod. 01 |Date           |Developer |Description(Reason)
************************************************************************
*         |2025-08-06     |강예인      | inital Coding
************************************************************************

REPORT ZTEST_ALV_CLASS_TEST MESSAGE-ID Z2508M84.

*--------------------------------------------------------------------*
* 선언관련 Include
*--------------------------------------------------------------------*
INCLUDE ZTEST_ALV_CLASS_TEST_TOP.
*INCLUDE ZTEST_ALV_CLASS_TOP.
INCLUDE ZTEST_ALV_CLASS_TEST_SCR.
*INCLUDE ZTEST_ALV_CLASS_SCR.
INCLUDE ZTEST_ALV_CLASS_TEST_CLS.
*INCLUDE ZTEST_ALV_CLASS_CLS.
*--------------------------------------------------------------------*
* 구현관련 Include
*--------------------------------------------------------------------*
INCLUDE ZTEST_ALV_CLASS_TEST_PBO.
*INCLUDE ZTEST_ALV_CLASS_PBO.
INCLUDE ZTEST_ALV_CLASS_TEST_PAI.
*INCLUDE ZTEST_ALV_CLASS_PAI.
INCLUDE ZTEST_ALV_CLASS_TEST_F01.
*INCLUDE ZTEST_ALV_CLASS_F01.

*--------------------------------------------------------------------*
INITIALIZATION.
*--------------------------------------------------------------------*
  PERFORM INIT_SET.
*--------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*--------------------------------------------------------------------*

*--------------------------------------------------------------------*
AT SELECTION-SCREEN.
*--------------------------------------------------------------------*

*--------------------------------------------------------------------*
START-OF-SELECTION.
*--------------------------------------------------------------------*

  PERFORM SELECT_DATA. " 전체 데이터 Select
  PERFORM CHECK_DATA.  " 데이터 유무 확인 및 화면 이동
